<?php
/**
 * Created by PhpStorm.
 * User: dangliuhui
 * Date: 2018/1/18
 * Time: 下午2:37
 */

/*
 *  项目配置
 */
return [

    /**********************************************
     * mysql数据库配置
     **********************************************/

    'mysql' => [
        //数据库地址
        'host' => '127.0.0.1',

        //数据库名字
        'database' => 'mm_chat',

        //端口
        'port' => 3306,

        //用户名
        'user' => 'root',

        //字符集
        'charset' => 'UTF8',

        //密码
        'password' => 'baagee@2018MySQL',
    ],


    /**********************************************
     * 其他配置
     **********************************************/

    //是否开启调试(开发者)模式
    'debug' => true,

    //时区
    'timezone' => 'Asia/Shanghai',

    //字符编码
    'charset' => 'utf-8',
];